"""Основы Python (Часть 1)"""
"""6. Дано целое число. Выведите его последнюю цифру.Например, дано 200 - последняя цифра 0. Дано 123 последняя цифра 3. Дано 587- последняя 7"""

a = '375'

print(a[-1])