"""Основы Python (Часть 1)"""
"""5. Дана строка"""

a = 'kkdLp10okdkPdlwk'

print(a[3]) # Сначала выведите третий символ этой строки
print(a[-2]) # Во второй строке выведите предпоследний символ строки
print(a[0 : 5]) # В третьей строке выведите первые пять символов строки
print(a[: - 2]) # В четвертой выведите всю до последних двух символов
print(a[:: 2]) # В пятой строке выведите все символы с четными индексами 
print(a[1 :: 2]) #  В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки
print(a[:: -1]) # В седьмой строке выведите все символы в обратном порядке
print(a[-1 : 2 : -2]) #  В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего
print((len(a))) # В девятой строке выведите длину данной строки